In [6804]:
# Programing for data analytics project 2

# Question

• Analyse CO2 vs Temperature Anomaly from 800kyrs – present.
• Examine one other (paleo/modern) features (e.g. CH4 or polar ice-coverage)
• Examine Irish context:
o Climate change signals: (see Maynooth study: The emergence of a climate change
signal in long-term Irish meteorological observations - ScienceDirect)
• Fuse and analyse data from various data sources and format fused data set as a pandas
dataframe and export to csv and json formats
• For all of the above variables, analyse the data, the trends and the relationships between
them (temporal leads/lags/frequency analysis).
• Predict global temperature anomaly over next few decades (synthesise data) and compare to
published climate models if atmospheric CO2 trends continue
• Comment on accelerated warming based on very latest features (e.g. temperature/polar-icecoverage)
Use a Jupyter notebook for your analysis and track your progress using GitHub.
Use an academic referencing style

# Import Required Libraries:

In [6805]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from scipy.stats import linregress
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.metrics import mean_squared_error

load data from c02 luthi

In [6806]:
import pandas as pd

# Load CO2 data from LUTHI
CO2_LUTHI_path = 'C:\\Users\\fifoa\\OneDrive\\Desktop\\ATU\\PFDA-PROJECT-2\\CO2 LUTHI.xls'
CO2_LUTHI_sheet1 = pd.read_excel(CO2_LUTHI_path, sheet_name='1.  new CO2 data')
CO2_LUTHI_sheet2 = pd.read_excel(CO2_LUTHI_path, sheet_name='2.  Vostok-TD-Dome C')

# Extract relevant columns

In [6807]:

monnin_luthi = CO2_LUTHI_sheet2.iloc[6:189, 1:3]
pepin_luthi = CO2_LUTHI_sheet2.iloc[19:353, 5:7]
siegenthaler_1_luthi = CO2_LUTHI_sheet1.iloc[6:26, 16:18]
siegenthaler_2_luthi = CO2_LUTHI_sheet2.iloc[6:328, 12:14]
luthi_luthi = CO2_LUTHI_sheet1.iloc[16:253, 1:3]

# Rename columns

In [6808]:

monnin_luthi.rename(columns={'Unnamed: 1': 'yr_bp', 'Unnamed: 2': 'co2_ppmv'}, inplace=True)
pepin_luthi.rename(columns={'Unnamed: 5': 'yr_bp', 'Unnamed: 6': 'co2_ppmv'}, inplace=True)
siegenthaler_1_luthi.rename(columns={'Unnamed: 16': 'yr_bp', 'Unnamed: 17': 'co2_ppmv'}, inplace=True)
siegenthaler_2_luthi.rename(columns={'Unnamed: 12': 'yr_bp', 'Unnamed: 13': 'co2_ppmv'}, inplace=True)
luthi_luthi.rename(columns={'Unnamed: 1': 'yr_bp', 'Unnamed: 2': 'co2_ppmv'}, inplace=True)

# Load CO2 data from IPCC

In [6809]:

CO2_IPCC_path = 'C:\\Users\\fifoa\\OneDrive\\Desktop\\ATU\\PFDA-PROJECT-2\\CO2 IPCC.xlsx'
CO2_IPCC_data = pd.read_excel(CO2_IPCC_path, sheet_name='all records')

# Extract relevant columns

In [6810]:

rubino = CO2_IPCC_data.iloc[90:, [83, 86]]
macfarling = CO2_IPCC_data.iloc[137:, 68:70]
monnin = CO2_IPCC_data.iloc[25:120, 2:4]
marcott = CO2_IPCC_data.iloc[31:321, 98:100]
ahn = CO2_IPCC_data.iloc[7:202, 89:91]
bereiter = CO2_IPCC_data.iloc[28:106, 34:36]
bereiter_2 = CO2_IPCC_data.iloc[60:154, 39:41]
schneider = CO2_IPCC_data.iloc[6:, 65:67]
petit = CO2_IPCC_data.iloc[124:348, 7:9]
siegenthaler = CO2_IPCC_data.iloc[6:26, 20:22]
siegenthaler_2 = CO2_IPCC_data.iloc[6:226, 15:17]
bereiter_3 = CO2_IPCC_data.iloc[37:, 102:104]

# Rename columns

In [6811]:

rubino.rename(columns={'Unnamed: 83': 'yr_bp', 'Unnamed: 86': 'co2_ppmv'}, inplace=True)
macfarling.rename(columns={'Law Dome (0-2 kyr BP)': 'yr_bp', 'Unnamed: 69': 'co2_ppmv'}, inplace=True)
monnin.rename(columns={'Unnamed: 2': 'yr_bp', 'Unnamed: 3': 'co2_ppmv'}, inplace=True)
marcott.rename(columns={'Unnamed: 98': 'yr_bp', 'Unnamed: 99': 'co2_ppmv'}, inplace=True)
ahn.rename(columns={'Unnamed: 89': 'yr_bp', 'Unnamed: 90': 'co2_ppmv'}, inplace=True)
bereiter.rename(columns={'Unnamed: 34': 'yr_bp', 'Unnamed: 35': 'co2_ppmv'}, inplace=True)
bereiter_2.rename(columns={'Unnamed: 39': 'yr_bp', 'Unnamed: 40': 'co2_ppmv'}, inplace=True)
schneider.rename(columns={'Unnamed: 65': 'yr_bp', 'Unnamed: 66': 'co2_ppmv'}, inplace=True)
petit.rename(columns={'Unnamed: 7': 'yr_bp', 'Unnamed: 8': 'co2_ppmv'}, inplace=True)
siegenthaler.rename(columns={'Unnamed: 20': 'yr_bp', 'Unnamed: 21': 'co2_ppmv'}, inplace=True)
siegenthaler_2.rename(columns={'Unnamed: 15': 'yr_bp', 'Unnamed: 16': 'co2_ppmv'}, inplace=True)
bereiter_3.rename(columns={'Unnamed: 102': 'yr_bp', 'Unnamed: 103': 'co2_ppmv'}, inplace=True)

# Merge datasets

In [6812]:
merged_data = pd.concat([monnin_luthi, pepin_luthi, siegenthaler_1_luthi, siegenthaler_2_luthi, luthi_luthi,
                         rubino, macfarling, monnin, marcott, ahn, bereiter, bereiter_2, schneider, petit,
                         siegenthaler, siegenthaler_2, bereiter_3], ignore_index=True)

# Explore the merged dataset

In [6813]:
# Explore the merged dataset
print(merged_data.head())

  yr_bp co2_ppmv
0   137    280.4
1   268    274.9
2   279    277.9
3   395    279.1
4   404    281.9

# CLENAING out non-DataFrame (EMPTY DATA FRAMES) objects from the merged_data,THIS WILL SKIP EMPTY DATAFRAMES

In [6814]:
# List of DataFrames in the 'merged_data' variable
merged_data = [monnin_luthi, pepin_luthi, siegenthaler_1_luthi, siegenthaler_2_luthi, luthi_luthi,
               rubino, macfarling, monnin, marcott, ahn, bereiter, bereiter_2, schneider, petit,
               siegenthaler, siegenthaler_2, bereiter_3]

# Filter out non-DataFrame objects
merged_data = [df for df in merged_data if isinstance(df, pd.DataFrame)]

Generating a column to compute the number of years before 2023

In [6815]:
import pandas as pd

def process_dataframe(df):
    # Print the original column names
    print(f"Original Column Names for DataFrame: {df.columns}")

    # Check if the DataFrame is not empty
    if not df.empty:
        # Rename columns
        df.rename(columns={'Unnamed: 1': 'yr_bp', 'Unnamed: 2': 'co2_ppmv'}, inplace=True)

        # Print the column names after renaming
        print(f"Column Names After Renaming for DataFrame: {df.columns}")

        # Create a column that calculates the number of years before 2023
        df['years_before_2023'] = 2023 - df['yr_bp']

        # Create a column that calculates the year
        df['calculated_year'] = 2023 + df['years_before_2023']

        # Drop rows with null values
        df.dropna(inplace=True)
    else:
        print("DataFrame is empty. Skipping processing.")

runing  loop to apply the process_dataframe function to each DataFrame and print the head of one of the processed DataFrames:

In [6816]:
# Apply the processing function to all DataFrames in the merged dataset
for df in merged_data:
    process_dataframe(df)

# Example: Print the head of one of the processed DataFrames
print(monnin_luthi.head())

Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index([], dtype='object')
DataFrame is empty. Skipping processing.
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Original Column Names for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
Column Names After Renaming for DataFrame: Index(['yr_bp', 'co2_ppmv'], dtype='object')
   yr_bp co2_ppmv years_before_2023 calculated_year
6    137    280.4              1886            3909
7    268    274.9              1755            3778
8    279    277.9              1744            3767
9    395    279.1              1628            3651
10   404    281.9              1619            3642

# CO2 Data 1979 - 2023 
Data is the most recent uptill date  data is gotten from https://gml.noaa.gov/webdata/ccgg/trends/co2/co2_mm_gl.txt accesed 01/01/2024

Loading in the file

In [6817]:
co2_global_csv = pd.read_csv(r'C:\Users\fifoa\OneDrive\Desktop\ATU\PFDA-PROJECT-2\co2global.csv')

In [6818]:
print(co2_global_csv.columns)

Index(['year', 'month                    ', 'decimal   ', 'average ',
       ' average_unc ', 'Trend   ', ' trend_unc'],
      dtype='object')

In [6819]:
# Print the first 5 rows of the DataFrame
print(co2_global_csv.head())

   year  month                      decimal     average    average_unc   \
0  1979                          1    1979.042    336.56           0.11
1  1979                          2    1979.125    337.29           0.09
2  1979                          3    1979.208    337.88           0.11
3  1979                          4    1979.292    338.32           0.12
4  1979                          5    1979.375    338.26           0.03

   Trend      trend_unc
0    335.92        0.09
1    336.25        0.10
2    336.51        0.10
3    336.72        0.10
4    336.71        0.10

drop columns and remove trailing whitespaces

In [6820]:
# Remove leading and trailing whitespaces from column names
co2_global_csv.columns = co2_global_csv.columns.str.strip()

In [6821]:
# Drop the 'Trend' column
co2_global_csv.drop(columns=['Trend'], inplace=True)

# Print the DataFrame after dropping the column
print(co2_global_csv.head())

   year  month   decimal  average  average_unc  trend_unc
0  1979      1  1979.042   336.56         0.11       0.09
1  1979      2  1979.125   337.29         0.09       0.10
2  1979      3  1979.208   337.88         0.11       0.10
3  1979      4  1979.292   338.32         0.12       0.10
4  1979      5  1979.375   338.26         0.03       0.10

In [6822]:
co2_global_csv

     year  month   decimal  average  average_unc  trend_unc
0    1979      1  1979.042   336.56         0.11       0.09
1    1979      2  1979.125   337.29         0.09       0.10
2    1979      3  1979.208   337.88         0.11       0.10
3    1979      4  1979.292   338.32         0.12       0.10
4    1979      5  1979.375   338.26         0.03       0.10
..    ...    ...       ...      ...          ...        ...
532  2023      5  2023.375   420.54         0.10       0.06
533  2023      6  2023.458   419.53         0.10       0.06
534  2023      7  2023.542   417.83         0.10       0.06
535  2023      8  2023.625   416.53         0.10       0.06
536  2023      9  2023.708   416.83         0.10       0.06

[537 rows x 6 columns]

# Jouzel (2007) Temperature Data

read in the file

In [6823]:
TEMP_JOUZEL_csv = pd.read_csv(r'C:\Users\fifoa\OneDrive\Desktop\ATU\PFDA-PROJECT-2\TEMPJOUZEL.csv')

Print first 5 row

In [6824]:
TEMP_JOUZEL_csv.head()

   bag  ztop  EDC3béta   AICC2012  deutfinal   temp  acc-EDC3beta
0    1  0.00 -50.00000 -55.000000        NaN  218.3      3.105321
1    2  0.55 -43.55977 -50.513333        NaN  218.3      3.104805
2    3  1.10 -37.44019 -46.026667        NaN  218.3      3.104404
3    4  1.65 -31.64156 -41.540000        NaN  218.3      3.104025
4    5  2.20 -24.55278 -34.516667        NaN  218.3      3.103453

DROPPING UNNECSARY COLUMNS

In [6825]:
# Specify columns to drop
columns_to_drop = ['bag', 'ztop', 'deutfinal', 'acc-EDC3beta']

# Drop the specified columns from the DataFrame
TEMP_JOUZEL_csv = TEMP_JOUZEL_csv.drop(columns=columns_to_drop)

The value 273.15 is the conversion factor commonly used to convert temperatures from Kelvin to Celsius. The Celsius scale is defined such that 0 degrees Celsius is the freezing point of water, which is equivalent to 273.15 Kelvin. Therefore, to convert temperatures from Kelvin to Celsius, you subtract 273.15.

If you're working with a different conversion factor, you would use that value instead. However, in most cases involving temperature conversions between Kelvin and Celsius, 273.15 is the appropriate constant to use.

Creating a new colunm called celcius

In [6826]:
# Create a new column 'celsius' by subtracting 273.15 from the 'temp' column
TEMP_JOUZEL_csv = TEMP_JOUZEL_csv.assign(celsius=lambda x: x['temp'] - 273.15)

# Calculate the mean of the 'celsius' column for rows 0 to 86

In [6827]:

average = TEMP_JOUZEL_csv.loc[0:86, 'celsius'].mean()

In [6828]:
# Print the result
print("Average Celsius Temperature:", average)

Average Celsius Temperature: -55.738505747126425

calculating the temperature anomaly in a new column named 'anomaly':

In [6829]:


TEMP_JOUZEL_csv['anomaly'] = TEMP_JOUZEL_csv['celsius'] - TEMP_JOUZEL_csv['celsius'].mean()

creating a column to calculate years before 2023

In [6830]:
TEMP_JOUZEL_csv['aicc2012_years_before_2023'] = 2023 - (1950 - TEMP_JOUZEL_csv['AICC2012'])

# calculate years before present EDC3 
TEMP_JOUZEL_csv['edc3_years_before_2023'] = 2023 - (1950 - TEMP_JOUZEL_csv['EDC3béta'])

Print data

In [6831]:
TEMP_JOUZEL_csv.head()

,EDC3béta,AICC2012,temp,celsius,anomaly,aicc2012_years_before_2023,edc3_years_before_2023
0,-50.00000,-55.000000,218.3,-54.85,4.825279,18.000000,23.00000
1,-43.55977,-50.513333,218.3,-54.85,4.825279,22.486667,29.44023
2,-37.44019,-46.026667,218.3,-54.85,4.825279,26.973333,35.55981
3,-31.64156,-41.540000,218.3,-54.85,4.825279,31.460000,41.35844
4,-24.55278,-34.516667,218.3,-54.85,4.825279,38.483333,48.44722

Changing the variable in the year before to integers

In [6832]:
TEMP_JOUZEL_csv[['aicc2012_years_before_2023', 'edc3_years_before_2023']] = TEMP_JOUZEL_csv[['aicc2012_years_before_2023', 'edc3_years_before_2023']].astype(int)

DROPPING DUPLICATED DATA AND KEEPING THE FIRST

In [6833]:
# Assuming 'jouzel_temp' is your DataFrame
TEMP_JOUZEL_csv.drop_duplicates(subset='aicc2012_years_before_2023', inplace=True)

pRINT AFTER REMOVING DUPLICATED DATA

In [6834]:
# Print the DataFrame after removing duplicates
print(TEMP_JOUZEL_csv)

          EDC3béta       AICC2012   temp  celsius   anomaly  \
0        -50.00000     -55.000000  218.3   -54.85  4.825279
1        -43.55977     -50.513333  218.3   -54.85  4.825279
2        -37.44019     -46.026667  218.3   -54.85  4.825279
3        -31.64156     -41.540000  218.3   -54.85  4.825279
4        -24.55278     -34.516667  218.3   -54.85  4.825279
...            ...            ...    ...      ...       ...
5814  816871.60000  817562.000000  211.0   -62.15 -2.474721
5815  817693.60000  818631.000000  211.2   -61.95 -2.274721
5816  818505.50000  819700.000000  211.3   -61.85 -2.174721
5817  819303.10000  820769.000000  211.4   -61.75 -2.074721
5818  820093.90000  821838.000000  211.4   -61.75 -2.074721

      aicc2012_years_before_2023  edc3_years_before_2023
0                             18                      23
1                             22                      29
2                             26                      35
3                             31                      41
4                             38                      48
...                          ...                     ...
5814                      817635                  816944
5815                      818704                  817766
5816                      819773                  818578
5817                      820842                  819376
5818                      821911                  820166

[5819 rows x 7 columns]

NOAA TEMPRETURE

In [6835]:
TEMP_noaa_csv = pd.read_csv(r'C:\Users\fifoa\OneDrive\Desktop\ATU\PFDA-PROJECT-2\TEMPnoaa.csv')

print head

In [6836]:
TEMP_noaa_csv.head()

  Bag  ztop      Year  Deuterium  Temperature
0   1  0.00 -50.00000        NaN          NaN
1   2  0.55 -43.54769        NaN          NaN
2   3  1.10 -37.41829        NaN          NaN
3   4  1.65 -31.61153        NaN          NaN
4   5  2.20 -24.51395        NaN          NaN

drop columns

In [6837]:
# Specify columns to drop
columns_to_drop = ['Bag', 'ztop']

# Drop the specified columns from the DataFrame
TEMP_noaa_csv = TEMP_noaa_csv.drop(columns=columns_to_drop)

creating a column to calculate the year and the year before 2023

In [6838]:
TEMP_noaa_csv['years_before_2023'] = 2023 - (1950-(TEMP_noaa_csv['Year']*1000))

In [6839]:
TEMP_noaa_csv.head()

       Year  Deuterium  Temperature  years_before_2023
0 -50.00000        NaN          NaN          -49927.00
1 -43.54769        NaN          NaN          -43474.69
2 -37.41829        NaN          NaN          -37345.29
3 -31.61153        NaN          NaN          -31538.53
4 -24.51395        NaN          NaN          -24440.95

# Replace NaN values with a default integer value (e.g., 0)

In [6840]:

TEMP_noaa_csv['years_before_2023'].fillna(0, inplace=True)

# Convert the column to integers

In [6841]:

TEMP_noaa_csv['years_before_2023'] = TEMP_noaa_csv['years_before_2023'].astype(int)

Print dataframe

In [6842]:

print(TEMP_noaa_csv)

              Year  Deuterium  Temperature  years_before_2023
0        -50.00000        NaN          NaN             -49927
1        -43.54769        NaN          NaN             -43474
2        -37.41829        NaN          NaN             -37345
3        -31.61153        NaN          NaN             -31538
4        -24.51395        NaN          NaN             -24440
...            ...        ...          ...                ...
5797  799501.00000    -441.10        -8.88          799501073
5798  800589.00000    -441.42        -8.92          800589073
5799  801662.00000    -440.90        -8.82          801662073
5800           NaN        NaN          NaN                  0
5801           NaN        NaN          NaN                  0

[5802 rows x 4 columns]

# methane 800kyr

 https://www.ncei.noaa.gov/pub/data/paleo/icecore/antarctica/epica_domec/edc-ch4-2008.txt   (13 - 800000)
Column 1: EDC1999 depth (m)
Column 2: Gas Age (EDC3 gas age, years before 1950 AD)
Column 3: CH4 mean (ppbv)
Column 4: 1-sigma uncertainty (ppbv)
Column 5: Laboratory (b=Bern, g=Grenoble)

EPICA Dome C Ice Core 800KYr Methane Data


https://www.ncei.noaa.gov/access/paleo-search/

READ FILE and asigning names for the data frames

In [6843]:
methane= pd.read_table('https://www1.ncdc.noaa.gov/pub/data/paleo/icecore/antarctica/epica_domec/edc-ch4-2008.txt', 
                          sep = ' ', skipinitialspace=True, skiprows = 155, 
                          names=['depth', 'yr_bp', 'ch4_ppb', '4', '5', '6', '7'])

remove colunms that are not useful

In [6844]:
# Specify columns to drop
columns_to_drop = ['depth', '4', '5', '6', '7']

# Drop the specified columns from the DataFrame
methane.drop(columns=columns_to_drop, axis=1, inplace=True)

Create Colunm year to calculate year

In [6845]:
methane['year'] = 1950 - methane['yr_bp']

Calculate Years before 2023

In [6846]:
def years_before_present(sample):
    sample['years_before_2023'] = 2023 - sample['year']

change dataframes to anscending orders

In [6847]:
methane = methane.sort_values('year', ascending=False)

In [6848]:
sets = [methane]

for set in sets: years_before_present(set)

In [6849]:
methane = methane.sort_values('year', ascending=False)

# rearranging

In [6850]:
methane = methane.reindex(columns=['year', 'ch4_ppb', 'years_before_2023', 'yr_bp'])

drop yr_bp columns

In [6851]:
methane.drop('yr_bp', axis=1, inplace=True)

In [6852]:
methane

        year  ch4_ppb  years_before_2023
0       1824      784                199
1       1820      762                203
2       1799      710                224
3       1766      727                257
4       1748      696                275
...      ...      ...                ...
2097 -792988      428             795011
2098 -794370      418             796393
2099 -795327      396             797350
2100 -796467      458             798490
2101 -797446      399             799469

[2102 rows x 3 columns]

REARRANGING COLUMNS

In [6853]:
 methane =methane.reindex(columns=['years_before_2023', 'year', 'ch4_ppb'])

In [6854]:
methane

      years_before_2023    year  ch4_ppb
0                   199    1824      784
1                   203    1820      762
2                   224    1799      710
3                   257    1766      727
4                   275    1748      696
...                 ...     ...      ...
2097             795011 -792988      428
2098             796393 -794370      418
2099             797350 -795327      396
2100             798490 -796467      458
2101             799469 -797446      399

[2102 rows x 3 columns]

REMOVING DUPLICATE

In [6855]:
methane.drop_duplicates(subset='years_before_2023', keep='first', inplace=True)

Change year to integers

In [6856]:
methane = methane.astype({'year':'int', 'years_before_2023':'int'})

In [6857]:
methane

      years_before_2023    year  ch4_ppb
0                   199    1824      784
1                   203    1820      762
2                   224    1799      710
3                   257    1766      727
4                   275    1748      696
...                 ...     ...      ...
2097             795011 -792988      428
2098             796393 -794370      418
2099             797350 -795327      396
2100             798490 -796467      458
2101             799469 -797446      399

[2102 rows x 3 columns]

# Methane 2023

read in file

Read files

In [6858]:
methane_2023 = pd.read_csv(r'C:\Users\fifoa\OneDrive\Desktop\ATU\PFDA-PROJECT-2\methane2023.csv')

In [6859]:
dates = pd.date_range(start='1983', end='2023', freq='MS')

In [6860]:
methane_2023

     year  month   decimal  average  average_unc    trend  trend_unc
0    1983      7  1983.542  1625.94         2.26  1634.88       1.45
1    1983      8  1983.625  1628.06         2.88  1635.45       1.39
2    1983      9  1983.708  1638.44         2.34  1636.07       1.32
3    1983     10  1983.792  1644.79         1.50  1636.75       1.24
4    1983     11  1983.875  1642.60         0.73  1637.49       1.16
..    ...    ...       ...      ...          ...      ...        ...
478  2023      5  2023.375  1920.00        -9.99  1922.60      -9.99
479  2023      6  2023.458  1915.94        -9.99  1923.72      -9.99
480  2023      7  2023.542  1914.56        -9.99  1924.85      -9.99
481  2023      8  2023.625  1919.15        -9.99  1926.00      -9.99
482  2023      9  2023.708  1927.35        -9.99  1927.13      -9.99

[483 rows x 7 columns]

IRISH CLIMATE

In [6861]:
irish_climate_csv = pd.read_csv(r'C:\Users\fifoa\OneDrive\Desktop\ATU\PFDA-PROJECT-2\irish climate.csv')

In [6862]:
irish_climate_csv

      Year  Month  Median montly series
0     1711      1                  16.4
1     1711      2                  73.1
2     1711      3                 121.2
3     1711      4                  85.2
4     1711      5                  66.6
...    ...    ...                   ...
3667  2016      8                  79.1
3668  2016      9                 108.1
3669  2016     10                  51.8
3670  2016     11                  58.0
3671  2016     12                  92.1

[3672 rows x 3 columns]

merged the months and year columns to create the time series

In [6863]:
import pandas as pd


irish_climate_csv['TimeSeries'] = pd.to_datetime(irish_climate_csv['Year'].astype(str) + '-' + irish_climate_csv['Month'].astype(str), format='%Y-%m')

#  set the 'TimeSeries' column as the index

In [6864]:



irish_climate_csv.set_index('TimeSeries', inplace=True)

In [6865]:
# Print the DataFrame after merging columns
print(irish_climate_csv)

            Year  Month  Median montly series
TimeSeries
1711-01-01  1711      1                  16.4
1711-02-01  1711      2                  73.1
1711-03-01  1711      3                 121.2
1711-04-01  1711      4                  85.2
1711-05-01  1711      5                  66.6
...          ...    ...                   ...
2016-08-01  2016      8                  79.1
2016-09-01  2016      9                 108.1
2016-10-01  2016     10                  51.8
2016-11-01  2016     11                  58.0
2016-12-01  2016     12                  92.1

[3672 rows x 3 columns]